## Задание 1

In [30]:
import pandas as pd
import numpy as np

In [6]:
authors = pd.DataFrame({'author_id': [1, 2, 3], 'author_name': ['Тургенев', 'Чехов', 'Островский']})

In [9]:
book = pd.DataFrame({'author_id': [1, 1, 1, 2, 2, 3, 3], 'book_title': ['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'], 'price': [450, 300, 350, 500, 450, 370, 290]})

In [10]:
authors

   author_id author_name
0          1    Тургенев
1          2       Чехов
2          3  Островский

In [11]:
book

   author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

## Задание 2

In [13]:
authors_price = pd.merge(authors, book, on = 'author_id', how = 'inner')
authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

## Задание 3

In [20]:
top5 = authors_price.sort_values(by = 'price', ascending = False)
top5.head(5)

   author_id author_name         book_title  price
3          2       Чехов   Толстый и тонкий    500
0          1    Тургенев        Отцы и дети    450
4          2       Чехов    Дама с собачкой    450
5          3  Островский              Гроза    370
2          1    Тургенев  Дворянское гнездо    350

## Задание 4

In [28]:
authors_price2 = authors_price.drop(['author_id'], axis=1)
authors_stat = authors_price2.groupby('author_name').agg({'min', 'max', 'mean'})
authors_stat = authors_stat.rename(columns={'mean': 'mean_price', 'max': 'max_price', 'min': 'min_price'})
authors_stat

                  price
             mean_price max_price min_price
author_name
Островский   330.000000       370       290
Тургенев     366.666667       450       300
Чехов        475.000000       500       450

## Задание 5

In [36]:
authors_price2['cover'] = ['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая']
authors_price2

  author_name            book_title  price    cover
0    Тургенев           Отцы и дети    450  твердая
1    Тургенев                 Рудин    300   мягкая
2    Тургенев     Дворянское гнездо    350   мягкая
3       Чехов      Толстый и тонкий    500  твердая
4       Чехов       Дама с собачкой    450  твердая
5  Островский                 Гроза    370   мягкая
6  Островский  Таланты и поклонники    290   мягкая

In [39]:
book_info = pd.pivot_table(authors_price2,
    index='author_name',
    columns='cover',
    aggfunc=np.sum,
    fill_value='NaN')
book_info

             price
cover       мягкая твердая
author_name
Островский     660     NaN
Тургенев       650     450
Чехов          NaN     950

In [40]:
book_info.to_pickle('book_info.pkl')

In [41]:
book_info2 = pd.read_pickle('book_info.pkl')

In [44]:
book_info == book_info2

             price
cover       мягкая твердая
author_name
Островский    True    True
Тургенев      True    True
Чехов         True    True